{
  "Logging": {
    "LogLevel": {
      //Рівень логування за замовчуванням. Можливі значення: Trace, Debug, Information, Warning, Error, Critical, None.
      //Зазвичай "Information" або "Warning" є хорошим вибором для робочого середовища.
      "Default": "Information",
      //Специфічний рівень логування для компонентів Microsoft.AspNetCore. "Warning" допоможе зменшити кількість логів від самого фреймворку.
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "ConnectionStrings": {
    //Рядок підключення до вашої бази даних Azure Cosmos DB.
    //Його можна знайти на порталі Azure у вашому акаунті Cosmos DB, в розділі "Keys" (Ключі) або "Connection strings" (Рядки підключення).
    //Для локальної розробки можна використовувати емулятор Cosmos DB, тоді рядок підключення буде виглядати схоже на приклад, але зі стандартними локальними значеннями емулятора.
    "CosmosDb": "Вставте сюди рядок підключення до вашого Azure Cosmos DB або локального емулятора. Приклад: AccountEndpoint=https://ВАШ_АКАУНТ.documents.azure.com:443/;AccountKey=ВАШ_КЛЮЧ==",
    //Рядок підключення до вашого Azure Blob Storage.
    //Його можна знайти на порталі Azure у вашому акаунті сховища (Storage Account), в розділі "Access keys" (Ключі доступу).
    //Для локальної розробки можна використовувати емулятор Azurite. Рядок підключення для Azurite зазвичай виглядає так:
    //"DefaultEndpointsProtocol=http;AccountName=devstoreaccount1;AccountKey=Eby8vdM02xNOcqFlqUwJPLlmEtlCDXJ1OUzFT50uSRZ6IFsuFq2UVErCz4I6tq/K1SZFPTOtr/KBHBeksoGMGw==;BlobEndpoint=http://127.0.0.1:10000/devstoreaccount1;QueueEndpoint=http://127.0.0.1:10001/devstoreaccount1;TableEndpoint=http://127.0.0.1:10002/devstoreaccount1;"
    "BlobStorage": "Вставте сюди рядок підключення до вашого Azure Blob Storage або локального емулятора Azurite."
  },
  "BlobStorageOptions": {
    //Назва контейнера в Azure Blob Storage для зберігання файлів статей.
    //Ви можете вибрати будь-яку назву. Цей контейнер буде створено, якщо він не існує.
    "ArticleContainer": "Вкажіть бажану назву контейнера для статей (наприклад, 'articles-container')",
    //Назва контейнера в Azure Blob Storage для зберігання зображень.
    //Ви можете вибрати будь-яку назву. Цей контейнер буде створено, якщо він не існує.
    "ImageContainer": "Вкажіть бажану назву контейнера для зображень (наприклад, 'images-container')"
  },
  "EmailSettings": {
    //Email-адреса, з якої будуть надсилатися листи.
    "SenderEmail": "Вкажіть вашу email-адресу відправника (наприклад, 'noreply@yourdomain.com')",
    //Ім'я відправника, яке буде відображатися в листах.
    "SenderName": "Вкажіть ім'я відправника (наприклад, 'Назва Вашого Проекту')",
    //Базова URL-адреса для посилання на відновлення пароля.
    //Зазвичай це URL вашого фронтенд-додатку з відповідним маршрутом та параметром токена.
    "PasswordUrl": "Вкажіть URL для сторінки відновлення пароля на вашому фронтенді (наприклад, 'http://localhost:3000/reset-password?token=')",
    //Базова URL-адреса для посилання на підтвердження email.
    //Зазвичай це URL вашого фронтенд-додатку з відповідним маршрутом та параметром токена.
    "EmailUrl": "Вкажіть URL для сторінки підтвердження email на вашому фронтенді (наприклад, 'http://localhost:3000/confirm-email?token=')",
    //Адреса SMTP-сервера вашого поштового провайдера (наприклад, 'smtp.gmail.com', 'smtp.office365.com').
    "SmtpServer": "Вкажіть адресу вашого SMTP-сервера",
    //Порт SMTP-сервера (наприклад, 587 для TLS, 465 для SSL).
    "SmtpPort": 0,
    //Ім'я користувача для автентифікації на SMTP-сервері (зазвичай це ваша email-адреса).
    "SmtpUsername": "Вкажіть ім'я користувача для SMTP (часто це SenderEmail)",
    //Пароль для автентифікації на SMTP-сервері.
    //Якщо використовуєте Gmail з двофакторною автентифікацією, тут потрібно вказати "пароль додатка".
    "SmtpPassword": "Вкажіть пароль для SMTP або пароль додатка",
    //Чи використовувати SSL/TLS для SMTP-з'єднання (true або false).
    "EnableSsl": true //Встановіть true, якщо ваш SMTP-сервер вимагає SSL/TLS
  },
  "CosmosConfiguration": {
    //ID (назва) бази даних в Azure Cosmos DB, яку буде використовувати ваш додаток.
    "QaDatabaseId": "Вкажіть назву вашої бази даних Cosmos DB (наприклад, 'MyApplicationDb')"
  },
  "JWT": {
    //Отримувач JWT токенів. Зазвичай це URL вашого API або фронтенд-додатку, який буде перевіряти токен.
    "ValidAudience": "Вкажіть URL вашого сервісу, для якого призначені токени (наприклад, 'http://localhost:5000' або 'https://api.yourdomain.com')",
    //Видавець JWT токенів. Зазвичай це URL вашого API, який генерує токени.
    "ValidIssuer": "Вкажіть URL вашого сервісу, який видає токени (наприклад, 'http://localhost:5000' або 'https://api.yourdomain.com')",
    //Секретний ключ для підпису JWT токенів доступу. Має бути довгим, випадковим та надійно збереженим.
    //НЕ ВИКОРИСТОВУЙТЕ ЦЕЙ ПРИКЛАД В РОБОЧОМУ СЕРЕДОВИЩІ! Згенеруйте власний надійний ключ.
    "Secret": "Згенеруйте та вставте сюди ДОВГИЙ ТА НАДІЙНИЙ СЕКРЕТНИЙ КЛЮЧ для JWT токенів доступу",
    //Секретний ключ для підпису JWT токенів оновлення. Має бути довгим, випадковим та надійно збереженим, і ВІДРІЗНЯТИСЯ від 'Secret'.
    //НЕ ВИКОРИСТОВУЙТЕ ЦЕЙ ПРИКЛАД В РОБОЧОМУ СЕРЕДОВИЩІ! Згенеруйте власний надійний ключ.
    "RefreshSecret": "Згенеруйте та вставте сюди ДОВГИЙ ТА НАДІЙНИЙ СЕКРЕТНИЙ КЛЮЧ для JWT токенів оновлення (відмінний від основного Secret)",
    //Час життя токена доступу в хвилинах.
    "AccessTokenExpirationMinutes": 0, //Вкажіть час життя токена доступу в хвилинах (наприклад, 15 або 60)
    //Час життя токена оновлення в днях.
    "RefreshTokenExpirationDays": 0 //Вкажіть час життя токена оновлення в днях (наприклад, 7 або 30)
  },
  "SuperAdminCredentials": {
    //Email-адреса для початкового облікового запису супер-адміністратора.
    //Цей обліковий запис може бути створений під час першого запуску або міграції.
    "Email": "Вкажіть email для початкового супер-адміністратора (наприклад, 'admin@yourdomain.com')",
    //Пароль для початкового облікового запису супер-адміністратора.
    //ОБОВ'ЯЗКОВО змініть цей пароль на надійний та унікальний для робочого середовища.
    "Password": "Вкажіть НАДІЙНИЙ пароль для початкового супер-адміністратора"
  },
  "CORS": {
    //Список джерел (origins), яким дозволено робити крос-доменні запити до вашого API.
    //Вкажіть URL вашого фронтенд-додатку. Для кількох джерел використовуйте кому: "http://localhost:3000", "https://yourapp.com".
    "AllowedOrigins": [
      "Вкажіть URL вашого фронтенд-додатку (наприклад, 'http://localhost:3001')"
      //Можна додати інші дозволені джерела, наприклад, 'https://your-production-frontend.com'"
    ]
  },
  //Визначає, які імена хостів може обслуговувати веб-сервер.
  //"*" означає будь-яке ім'я хоста, що зручно для розробки.
  //Для робочого середовища рекомендується вказувати конкретні доменні імена для безпеки.
  "AllowedHosts": "Для розробки '*' є прийнятним. Для продакшену вкажіть конкретні хости (наприклад, 'yourdomain.com,api.yourdomain.com')"
}
